# HW01 (ไม่ลบหรือแก้ไขบรรทัดนี้ หรือเพิ่มอะไรก่อนบรรทัดนี้ โดยเด็ดขาด)

def center(r):
    return [(r[0]+(r[0]+r[2]))/2, ((r[1]-r[-1])+r[1])/2]


#======================================
def distance(r1, r2):
    r1 = center(r1)
    r2 = center(r2)
    return pow((r1[0]-r2[0])**2 + (r1[1]-r2[1])**2, 1/2)


#======================================
def intersection(r1, r2):
    r1 = [r1[0], r1[1]-r1[-1], r1[0]+r1[2], r1[1]]
    r2 = [r2[0], r2[1]-r2[-1], r2[0]+r2[2], r2[1]]
    x = max(min(r1[2], r2[2]) - max(r1[0], r2[0]), 0.0)
    y = max(min(r1[3], r2[3]) - max(r1[1], r2[1]), 0.0)
    return x*y

#======================================
def union(r1, r2):
    intersect_area = intersection(r1, r2)
    r1 = [r1[0], r1[1]-r1[-1], r1[0]+r1[2], r1[1]]
    r2 = [r2[0], r2[1]-r2[-1], r2[0]+r2[2], r2[1]]
    area_r1 = (r1[2] - r1[0]) * (r1[3] - r1[1])
    area_r2 = (r2[2] - r2[0]) * (r2[3] - r2[1])
    return (area_r1 + area_r2) - intersect_area

#======================================
def iou(r1, r2):
    return intersection(r1, r2) / union(r1, r2)


#======================================